Coordenadas.org
#+OPTIONS: num:nil
#+TITLE:  Coordenadas
#+AUTHOR: Gabriel Petrini
#+PROPERTY:header-args R :results output drawer :eval never-export :exports both :session *coords* :tangle ./coordenadas.R
#+PROPERTY:header-args python :results output drawer :eval never-export :exports both :session *coords*
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

* Carregando pacotes e dados

** Pacotes

#+begin_src R  :tangle ./coordenadas.R :exports none
library(tidyverse)
library(tidygeocoder)
library(tabulizer)
library(geodist)
library(data.table)
library(SetMethods)
#+end_src

#+RESULTS:
:results:
── [1mAttaching packages[22m ────────────────────────────────────────────────────────────────────────────────────────────── tidyverse 1.3.0 ──
[32m✔[39m [34mggplot2[39m 3.3.3     [32m✔[39m [34mpurrr  [39m 0.3.4
[32m✔[39m [34mtibble [39m 3.0.6     [32m✔[39m [34mdplyr  [39m 1.0.4
[32m✔[39m [34mtidyr  [39m 1.1.2     [32m✔[39m [34mstringr[39m 1.4.0
[32m✔[39m [34mreadr  [39m 1.4.0     [32m✔[39m [34mforcats[39m 0.5.1
── [1mConflicts[22m ───────────────────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
[31m✖[39m [34mdplyr[39m::[32mfilter()[39m masks [34mstats[39m::filter()
[31m✖[39m [34mdplyr[39m::[32mlag()[39m    masks [34mstats[39m::lag()
data.table 1.13.6 using 2 threads (see ?getDTthreads).  Latest news: r-datatable.com

Attaching package: ‘data.table’

The following objects are masked from ‘package:dplyr’:

    between, first, last

The following object is masked from ‘package:purrr’:

    transpose
Carregando pacotes exigidos: QCA
Carregando pacotes exigidos: admisc

Attaching package: ‘admisc’

The following objects are masked from ‘package:dplyr’:

    compute, recode

The following objects are masked from ‘package:purrr’:

    negate, simplify

The following object is masked from ‘package:tidyr’:

    expand


To cite package QCA in publications, please use:
  Dusa, Adrian (2019) QCA with R. A Comprehensive Resource.
  Springer International Publishing.

To run the graphical user interface, use: runGUI()


Carregando pacotes exigidos: ggrepel
Carregando pacotes exigidos: stargazer

Please cite as:

 Hlavac, Marek (2018). stargazer: Well-Formatted Regression and Summary Statistics Tables.
 R package version 5.2.2. https://CRAN.R-project.org/package=stargazer



  To cite package SetMethods in publications use:

  Oana, Ioana-Elena and Carsten Q. Schneider. 2018. SetMethods: An Add-on R Package for
  Advanced QCA. The R Journal 10(1): 507-33. https://journal.r-project.org/archive/2018/RJ-2018-031/index.html
:end:



** Capitais

#+begin_src R :tangle ./coordenadas.R
capitals <-maps::world.cities %>%
  filter(capital == "1") %>%
  select(country.etc, name) %>% # long and lat will be used in osm method
  rename(pais = country.etc, capital = name) %>%
  geocode(city = capital, country = pais, method = 'osm', lat = latitude, long = longitude) %>%
  mutate(ISO3C = countrycode::countrycode(pais, origin ='country.name',destination ='iso3c', warn = FALSE))

data.table::fwrite(capitals, file = "./clean/coord_capitais.csv")
#+end_src

* Conflitos violentos

