Coordenadas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-07 seg 17:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coordenadas</title>
<meta name="author" content="Gabriel Petrini" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Coordenadas</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2bfc348">Carregando pacotes e dados</a>
<ul>
<li><a href="#org28ba4af">Pacotes</a></li>
<li><a href="#orgfc5cfb0">Capitais</a></li>
</ul>
</li>
<li><a href="#orga84bdef">Conflitos violentos</a>
<ul>
<li><a href="#orgabb14a0">Tabela no texto (p. 366-7)</a></li>
<li><a href="#org083db74">Importando dados</a></li>
<li><a href="#orgeb2ca60">Criando dataframe vazio</a></li>
<li><a href="#org6517c49">Função para calcular distância</a></li>
<li><a href="#org82ab223">Aplicando função</a></li>
<li><a href="#orga6576e2">Exportando</a></li>
<li><a href="#org9f115cc">Agrupando por regiões</a></li>
<li><a href="#org4dce748">Exportando</a></li>
</ul>
</li>
<li><a href="#orga07f125">Conflitos não-violentos</a>
<ul>
<li><a href="#orga37ef1a">Tabela no texto (p. 2 (apêndice))</a></li>
<li><a href="#org955a260">Importando dados</a></li>
<li><a href="#org0a79f67">Criando dataframe vazio</a></li>
<li><a href="#orgd37980c">Aplicando função</a></li>
<li><a href="#org61e6acb">Exportando</a></li>
<li><a href="#org5d990c7">Agrupando por regiões</a></li>
<li><a href="#orgf95ce6c">Exportando</a></li>
</ul>
</li>
<li><a href="#org778feeb">Selecionando países</a>
<ul>
<li><a href="#org6072f83">Importando e combinando dataframes</a></li>
<li><a href="#org871d3a4">Filtrando países (Tabela A.1)</a></li>
<li><a href="#org3e9f5d7">Exportando</a></li>
</ul>
</li>
<li><a href="#org1f3a829">Calculando inverso da distância</a></li>
<li><a href="#org98d79df">Incluindo dados de distribuição</a>
<ul>
<li><a href="#orge92f21a">Script Lorena</a></li>
<li><a href="#orgb4ddb05">Renomeando países para ISO</a></li>
<li><a href="#orgb92c672">Unindo com distâncias</a></li>
</ul>
</li>
<li><a href="#org653e40a">Unindo com dados do artigo de referência</a>
<ul>
<li><a href="#org1129ae3">Dicionário de variáveis</a></li>
<li><a href="#org587c7ad">Importando dados</a></li>
<li><a href="#org2f0a94d">Unindo as bases</a></li>
</ul>
</li>
<li><a href="#org54068cb">Calibragem</a>
<ul>
<li><a href="#org7407cb7">Calibrando conflitos</a></li>
<li><a href="#orgf581f47">Calibrando outras variáveis</a></li>
</ul>
</li>
<li><a href="#org22cecd5">Tabela verdade e minimização</a>
<ul>
<li><a href="#orga49d8b5">Maior concentração (1989 - 1945 &gt; 0)</a>
<ul>
<li><a href="#org1ae3755">Tabela verdade</a></li>
<li><a href="#orgd8eb8da">Solução conservadora</a></li>
<li><a href="#org2517bf9">Solução parsimoniosa</a></li>
</ul>
</li>
<li><a href="#org2f4c463">Menor concentração (1989 - 1945 &lt; 0)</a>
<ul>
<li><a href="#org0b5434f">Tabela verdade</a></li>
<li><a href="#orgc19a9c5">Solução conservadora</a></li>
<li><a href="#org98f5bcd">Solução parsimoniosa</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8ef9e0">TODOs</a>
<ul>
<li><a href="#org168ede7"><span class="todo TODO">TODO</span> Conferir NAs da base</a></li>
<li><a href="#orgadaafa5"><span class="todo TODO">TODO</span> Decidir se as medidas de centralidade são sempre as médias</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2bfc348" class="outline-2">
<h2 id="org2bfc348">Carregando pacotes e dados</h2>
<div class="outline-text-2" id="text-org2bfc348">
</div>
<div id="outline-container-org28ba4af" class="outline-3">
<h3 id="org28ba4af">Pacotes</h3>
</div>

<div id="outline-container-orgfc5cfb0" class="outline-3">
<h3 id="orgfc5cfb0">Capitais</h3>
<div class="outline-text-3" id="text-orgfc5cfb0">
<div class="org-src-container">
<pre class="src src-R">capitals <span style="color: #f78c6c;">&lt;-</span>maps::world.cities <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>capital <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"1"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>country.etc, name<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #556369;"># </span><span style="color: #556369;">long and lat will be used in osm method</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>pais <span style="color: #f78c6c;">=</span> country.etc, capital <span style="color: #f78c6c;">=</span> name<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">geocode</span><span style="color: #f78c6c;">(</span>city <span style="color: #f78c6c;">=</span> capital, country <span style="color: #f78c6c;">=</span> pais, method <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">'osm'</span>, lat <span style="color: #f78c6c;">=</span> latitude, long <span style="color: #f78c6c;">=</span> longitude<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>ISO3C <span style="color: #f78c6c;">=</span> countrycode::<span style="color: #82aaff;">countrycode</span><span style="color: #f78c6c;">(</span>pais, origin <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'country.name'</span>,destination <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'iso3c'</span>, warn <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">FALSE</span><span style="color: #f78c6c;">))</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>capitals, file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/coord_capitais.csv"</span><span style="color: #f78c6c;">)</span>
</pre>
</div>
</div>
</div>
</div>
