Coordenadas.org
** Importando dados

#+begin_src R :var conflicts=violentos  :tangle ./coordenadas.R

capitais <- data.table::fread(file = "./clean/coord_capitais.csv")

conflicts <- conflicts %>%
  rename(Year = V1, Country = V2, Proxy = V3, Continente = V4) %>%
  mutate(ISO3C = countrycode::countrycode(Country, origin ='country.name',destination ='iso3c', warn = FALSE)) %>%
  left_join(capitais) %>%
  mutate(pais = # Keep countries not found in dataset
           pais %>%
             is.na %>%
             ifelse(Country, pais) ) %>%
  mutate(ISO3C = replace_na(ISO3C, "404")) %>%
  mutate(Continente = factor(Continente))


## proxies <-conflicts %>% filter(ISO3C == "404") %>%
##   mutate(capital = case_when())
##   mutate(capital = Proxy) %>% # Keep countries not found in dataset
##   ## select(-c(latitude, longitude)) %>%
##   geocode(city = capital, method = 'osm', lat = latitude, long = longitude)

conflicts <- conflicts %>%
  mutate(capital = case_when(
         ISO3C == "404" ~ Proxy,
         TRUE ~ capital)) %>%
  mutate(ISO3C = case_when(
           pais == "East Germany" ~ "GERe",
           pais == "Czechoslovakia" ~ "oCZE",
           pais == "North and South Korea" ~ "PRK",
           TRUE ~ ISO3C # Não sei se faz isso, mas a ideia dessa linha é manter todo o restante como antes
         )) %>%
  mutate(pais = case_when( # Atualizando nome dos países para preencher coordenadas faltantes
           pais == "East Germany" ~ "Germany",
           pais == "Czechoslovakia" ~ "Czech Republic",
           pais == "North and South Korea" ~ "North Korea",
           TRUE ~ pais
         )) %>%
  select(-c(latitude, longitude)) %>%
  geocode(city = capital, country = pais, method = 'osm', lat = latitude, long = longitude)
  
    
conflicts <- conflicts %>%
  mutate(latitude  = case_when(
           ISO3C == "PRK" ~ 39.032, # https://pt.db-city.com/Coreia-do-Norte--Pyongyang
           TRUE ~ as.numeric(latitude)))
conflicts <- conflicts %>%
  mutate(longitude  = case_when(
           ISO3C == "PRK" ~ 125.75, # https://pt.db-city.com/Coreia-do-Norte--Pyongyang
           TRUE ~ as.numeric(longitude)))


conflicts <- conflicts %>%
  arrange(Year) %>%
  mutate(
    name = paste0(capital, "_", Year %>% as.character() %>% str_sub(start=-2), "_", Continente)
  ) %>%
  mutate(name = str_replace_all(name, " ", ""))
    

data.table::fwrite(conflicts, file = "./clean/coord_conflitos_violentos.csv")
#+end_src

#+RESULTS:
:results:
Joining, by = "ISO3C"
:end:



** Criando dataframe vazio

#+begin_src R  :tangle ./coordenadas.R
capitais <- data.table::fread(file = "./clean/coord_capitais.csv") %>% arrange(ISO3C)
conflitos <- data.table::fread(file = "./clean/coord_conflitos_violentos.csv") %>% arrange(ISO3C)

repeticoes <- conflitos %>% group_by(name) %>% group_size() # Equivalente ao Cr do artigo (vezes que ocorreu)

df <- matrix(
  nrow = capitais$longitude %>% length(),
  ncol = conflitos$name %>% unique() %>% length()
) %>%
  as.data.frame()


names(df) <- conflitos$name %>% unique()
df$ISO <- capitais$ISO3
df <- df[,c("ISO", conflitos$name)] %>%
  arrange(ISO)
df <- df %>% pivot_longer(!ISO,names_to = "Origem")
#+end_src

#+RESULTS:
:results:
:end:








