Coordenadas.html


<div id="outline-container-org083db74" class="outline-3">
<h3 id="org083db74">Importando dados</h3>
<div class="outline-text-3" id="text-org083db74">
<div class="org-src-container">
<pre class="src src-R">
capitais <span style="color: #f78c6c;">&lt;-</span> data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span>file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/coord_capitais.csv"</span><span style="color: #f78c6c;">)</span>

conflicts <span style="color: #f78c6c;">&lt;-</span> conflicts <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>Year <span style="color: #f78c6c;">=</span> V1, Country <span style="color: #f78c6c;">=</span> V2, Proxy <span style="color: #f78c6c;">=</span> V3, Continente <span style="color: #f78c6c;">=</span> V4<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>ISO3C <span style="color: #f78c6c;">=</span> countrycode::<span style="color: #82aaff;">countrycode</span><span style="color: #f78c6c;">(</span>Country, origin <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'country.name'</span>,destination <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'iso3c'</span>, warn <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">FALSE</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">left_join</span><span style="color: #f78c6c;">(</span>capitais<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>pais <span style="color: #f78c6c;">=</span> <span style="color: #556369;"># </span><span style="color: #556369;">Keep countries not found in dataset</span>
           pais <span style="color: #f78c6c;">%&gt;%</span>
             is.na <span style="color: #f78c6c;">%&gt;%</span>
             <span style="color: #82aaff;">ifelse</span><span style="color: #f78c6c;">(</span>Country, pais<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>ISO3C <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">replace_na</span><span style="color: #f78c6c;">(</span>ISO3C, <span style="color: #c3e88d;">"404"</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>Continente <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">factor</span><span style="color: #f78c6c;">(</span>Continente<span style="color: #f78c6c;">))</span>


<span style="color: #556369;">## </span><span style="color: #556369;">proxies &lt;-conflicts %&gt;% filter(ISO3C == "404") %&gt;%</span>
<span style="color: #556369;">##   </span><span style="color: #556369;">mutate(capital = case_when())</span>
<span style="color: #556369;">##   </span><span style="color: #556369;">mutate(capital = Proxy) %&gt;% # Keep countries not found in dataset</span>
<span style="color: #556369;">##   </span><span style="color: #556369;">## select(-c(latitude, longitude)) %&gt;%</span>
<span style="color: #556369;">##   </span><span style="color: #556369;">geocode(city = capital, method = 'osm', lat = latitude, long = longitude)</span>

conflicts <span style="color: #f78c6c;">&lt;-</span> conflicts <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>capital <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">case_when</span><span style="color: #f78c6c;">(</span>
         ISO3C <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"404"</span> ~ Proxy,
         <span style="color: #c792ea;">TRUE</span> ~ capital<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>ISO3C <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">case_when</span><span style="color: #f78c6c;">(</span>
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"East Germany"</span> ~ <span style="color: #c3e88d;">"GERe"</span>,
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"Czechoslovakia"</span> ~ <span style="color: #c3e88d;">"oCZE"</span>,
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"North and South Korea"</span> ~ <span style="color: #c3e88d;">"PRK"</span>,
           <span style="color: #c792ea;">TRUE</span> ~ ISO3C <span style="color: #556369;"># </span><span style="color: #556369;">N&#227;o sei se faz isso, mas a ideia dessa linha &#233; manter todo o restante como antes</span>
         <span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>pais <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">case_when</span><span style="color: #f78c6c;">(</span> <span style="color: #556369;"># </span><span style="color: #556369;">Atualizando nome dos pa&#237;ses para preencher coordenadas faltantes</span>
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"East Germany"</span> ~ <span style="color: #c3e88d;">"Germany"</span>,
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"Czechoslovakia"</span> ~ <span style="color: #c3e88d;">"Czech Republic"</span>,
           pais <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"North and South Korea"</span> ~ <span style="color: #c3e88d;">"North Korea"</span>,
           <span style="color: #c792ea;">TRUE</span> ~ pais
         <span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span><span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span>latitude, longitude<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">geocode</span><span style="color: #f78c6c;">(</span>city <span style="color: #f78c6c;">=</span> capital, country <span style="color: #f78c6c;">=</span> pais, method <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">'osm'</span>, lat <span style="color: #f78c6c;">=</span> latitude, long <span style="color: #f78c6c;">=</span> longitude<span style="color: #f78c6c;">)</span>
  
    
conflicts <span style="color: #f78c6c;">&lt;-</span> conflicts <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>latitude  <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">case_when</span><span style="color: #f78c6c;">(</span>
           ISO3C <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"PRK"</span> ~ <span style="color: #f78c6c; font-weight: bold;">39.032</span>, <span style="color: #556369;"># </span><span style="color: #556369;">https://pt.db-city.com/Coreia-do-Norte--Pyongyang</span>
           <span style="color: #c792ea;">TRUE</span> ~ <span style="color: #82aaff;">as.numeric</span><span style="color: #f78c6c;">(</span>latitude<span style="color: #f78c6c;">)))</span>
conflicts <span style="color: #f78c6c;">&lt;-</span> conflicts <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>longitude  <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">case_when</span><span style="color: #f78c6c;">(</span>
           ISO3C <span style="color: #f78c6c;">==</span> <span style="color: #c3e88d;">"PRK"</span> ~ <span style="color: #f78c6c; font-weight: bold;">125.75</span>, <span style="color: #556369;"># </span><span style="color: #556369;">https://pt.db-city.com/Coreia-do-Norte--Pyongyang</span>
           <span style="color: #c792ea;">TRUE</span> ~ <span style="color: #82aaff;">as.numeric</span><span style="color: #f78c6c;">(</span>longitude<span style="color: #f78c6c;">)))</span>


conflicts <span style="color: #f78c6c;">&lt;-</span> conflicts <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">arrange</span><span style="color: #f78c6c;">(</span>Year<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>
    name <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span>capital, <span style="color: #c3e88d;">"_"</span>, Year <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.character</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">str_sub</span><span style="color: #f78c6c;">(</span>start<span style="color: #f78c6c;">=-</span><span style="color: #f78c6c; font-weight: bold;">2</span><span style="color: #f78c6c;">)</span>, <span style="color: #c3e88d;">"_"</span>, Continente<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>name <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">str_replace_all</span><span style="color: #f78c6c;">(</span>name, <span style="color: #c3e88d;">" "</span>, <span style="color: #c3e88d;">""</span><span style="color: #f78c6c;">))</span>
    

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>conflicts, file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/coord_conflitos_violentos.csv"</span><span style="color: #f78c6c;">)</span>
</pre>
</div>

<p>
Joining, by = &ldquo;ISO3C&rdquo;
</p>
</div>
</div>
