Coordenadas.org
** Função para calcular distância

#+begin_src R  :tangle ./coordenadas.R
distancia <- function(method = "geodesic", Destino, Origem) {
  geodist::geodist(
    x = capitais %>% filter(ISO3C == Destino) %>% select(latitude, longitude),
    y = conflitos %>% filter(name == Origem) %>% select(latitude, longitude),
    measure = method
    ## Nfrom = col_df %>% filter(name == matrix_col) %>% select(latitude) %>% as.numeric(), # latitude of origin
    ## Efrom = col_df %>% filter(name == matrix_col) %>% select(longitude) %>% as.numeric(), # latitude of origin
    ## Nto = row_df %>% filter(ISO3C == matrix_row) %>% select(latitude) %>% as.numeric(), # latitude of origin
    ## Eto = row_df %>% filter(ISO3C == matrix_row) %>% select(longitude) %>% as.numeric(), # latitude of origin
    ## units = units
  )[1]/1000 %>% as.numeric()
}
#+end_src

#+RESULTS:
:results:
:end:

** Aplicando função

#+begin_src R  :tangle ./coordenadas.R

## start <- sum(df$ISO == "") + 1
## for(i in start:nrow(df)){
##   for(j in 2:ncol(df)){
##     df[i,j] = distancia(
##       matrix_col = names(df)[j],
##       matrix_row = df$ISO[i]
##         )
##   }
## }

df <- data.table(df)
df[, Distancia := distancia(Origem = Origem, Destino = ISO), by = 1:nrow(df)]
df <- df %>% as.data.frame()
#+end_src

#+RESULTS:
:results:
:end:

** Exportando

#+begin_src R :tangle ./coordenadas.R

df <- df %>%
  distinct() %>%
  pivot_wider(names_from = Origem, values_from = Distancia)
    
data.table::fwrite(df, file = "./raw/distancia_geodesica.csv")
#+end_src

#+RESULTS:
:results:
:end:

