Coordenadas.org
** Agrupando por regiões

#+begin_src R :tangle ./coordenadas.R
df <- data.table::fread("./raw/distancia_geodesica.csv") %>% select(!c(value))
df <- df %>% # Remove colunas que contêm apenas NA
  select(
    where(
      ~!all(is.na(.x))
    )
  )
    
continentes <- c(
  "Africa",
  "Americas",
  "Asia",
  "Europa"
    )

for(continente in continentes){
  subset <- str_subset(names(df), continente)
  df <- df %>%
    drop_na(any_of(subset)) %>%
    mutate("Violentos_{continente}" := rowMeans(across(all_of(subset))))
  
}
    
    
subset <- str_subset(names(df), "Violentos")
df <- df %>% select(ISO, all_of(subset)) %>%
    mutate("Violentos" := rowMeans(across(all_of(subset))))
#+end_src

#+RESULTS:
:results:
:end:




** Exportando

#+begin_src R  :tangle ./coordenadas.R
data.table::fwrite(df, file = "./clean/conflitos_violentos_continentes.csv")
#+end_src

#+RESULTS:
:results:
:end:


* Conflitos não-violentos

** Tabela no texto (p. 2 (apêndice))
#+CAPTION: Communist-led events (non-violents)
#+NAME: nao_violentos
|------+----------------+----------+----------|
| 1945 | Czechoslovakia | Prague   | Europa   |
| 1945 | Bulgaria       |          | Europa   |
| 1945 | Yugoslavia     | Belgrade | Europa   |
| 1945 | Romania        |          | Europa   |
| 1947 | Poland         |          | Europa   |
| 1947 | Hungary        |          | Europa   |
| 1947 | Bulgaria       |          | Europa   |
| 1947 | Romania        |          | Europa   |
| 1948 | North Korea    |          | Asia     |
| 1948 | Hungary        |          | Europa   |
| 1948 | East Germany   | Bonn     | Europa   |
| 1949 | USSR           | Moscow   | Europa   |
| 1949 | North Korea    |          | Asia     |
| 1949 | East Germany   | Bonn     | Europa   |
| 1949 | China          |          | Asia     |
| 1952 | East Germany   | Bonn     | Europa   |
| 1954 | East Germany   | Bonn     | Europa   |
| 1960 | Cuba           |          | Americas |
| 1960 | Cuba           |          | Americas |
| 1970 | Chile          |          | Americas |
| 1976 | Vietinam       |          | Asia     |
| 1977 | Ethiopia       |          | Africa   |
|------+----------------+----------+----------|


