Coordenadas.org
** Agrupando por regiões

#+begin_src R :tangle ./coordenadas.R
df <- data.table::fread("./raw/distancia_geodesica_naoviolentos.csv") %>% select(!c(value))
df <- df %>% # Remove colunas que contêm apenas NA
  select(
    where(
      ~!all(is.na(.x))
    )
  )

continentes <- c(
  "Africa",
  "Americas",
  "Asia",
  "Europa"
    )

for(continente in continentes){
  subset <- str_subset(names(df), continente)
  df <- df %>%
    drop_na(any_of(subset)) %>%
    mutate("NaoViolentos_{continente}" := rowMeans(across(all_of(subset))))

}


subset <- str_subset(names(df), "Violentos")
df <- df %>% select(ISO, all_of(subset)) %>%
    mutate("NaoViolentos" := rowMeans(across(all_of(subset))))
#+end_src

#+RESULTS:
:results:
:end:




** Exportando

#+begin_src R  :tangle ./coordenadas.R
data.table::fwrite(df, file = "./clean/conflitos_naoviolentos_continentes.csv")
#+end_src

#+RESULTS:
:results:
:end:

* Selecionando países

** Importando e combinando dataframes

#+begin_src R :tangle ./coordenadas.R
data.table::fread("./clean/conflitos_violentos_continentes.csv") -> violentos
data.table::fread("./clean/conflitos_naoviolentos_continentes.csv") -> naoviolentos

df <- violentos %>%
  arrange(ISO) %>%
  left_join(naoviolentos) %>%
  arrange(ISO)
#+end_src

#+RESULTS:
:results:
Joining, by = "ISO"
:end:

