Coordenadas.org
** Filtrando países (Tabela A.1)


#+begin_src R :tangle ./coordenadas.R
paises <- c(
  "Australia",
  "Canada",
  "Denmark",
  "Finland",
  "France",
  "Germany",
  "Ireland",
  "Italy",
  "Japan",
  "Netherlands",
  "New Zealand",
  "Norway",
  "Portugal",
  "Spain",
  "Sweden",
  "Switzerland",
  "UK",
  "USA" # Ausente no original
)


ISOs <- data.table::fread(file = "./clean/coord_capitais.csv") %>%
  filter(pais %in% paises) %>%
  select(ISO3C) %>%
  rename(ISO = ISO3C)

df <- df %>%
  filter(ISO %in% ISOs$ISO %>% c())
    
    
#+end_src

#+RESULTS:
:results:
:end:




** Exportando

#+begin_src R :tangle ./coordenadas.R
data.table::fwrite(df, file = "./clean/conflitos_filtrados_n_violentos_continentes.csv")
#+end_src

#+RESULTS:
:results:
:end:

* Calculando inverso da distância



#+BEGIN_latex
\begin{equation}
Cold war Event = 1000 \cdot \sum W_{j}\cdot CR_{j}
\end{equation}
#+END_latex

#+BEGIN_latex
\begin{equation}
W_{j} = dist^{-2}
\end{equation}
#+END_latex

em que dist é medido em quilometros.

#+begin_src R :tangle ./coordenadas.R

data.table::fread("./clean/conflitos_filtrados_n_violentos_continentes.csv") -> df

inv_dist2 <- function(x, pow=-1){
  x^pow*10^3
}

df <- df %>%
  mutate(across(where(is.numeric), ~inv_dist2(.x)))

data.table::fwrite(df, file = "./clean/coldwar_inv2_n_violentos_selecionados.csv")
#+end_src

* Incluindo dados de distribuição

** Script Lorena

#+begin_src R :tangle ./coordenadas.R
one_percent_income <- read.csv2("./raw/WID_Data_11042021-185939.csv")

# subseting
year <- one_percent_income[, 1, drop = FALSE]
income <- one_percent_income[, 2:19]

# cleaning data
# gsub() or nchar() as additional options
colnames(income) <- substring(colnames(income), 52)

# transforming in ISO3
colnames(income) <- countrycode(colnames(income), origin = "country.name", destination = "iso3c")

# joining subsets again
income_concentration <- cbind(year, income)

# exporting to csv
write.csv(income_concentration, "./clean/income_concentration.csv")
#+end_src


