Coordenadas.html

<div id="outline-container-org871d3a4" class="outline-3">
<h3 id="org871d3a4">Filtrando países (Tabela A.1)</h3>
<div class="outline-text-3" id="text-org871d3a4">
<div class="org-src-container">
<pre class="src src-R">paises <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span>
  <span style="color: #c3e88d;">"Australia"</span>,
  <span style="color: #c3e88d;">"Canada"</span>,
  <span style="color: #c3e88d;">"Denmark"</span>,
  <span style="color: #c3e88d;">"Finland"</span>,
  <span style="color: #c3e88d;">"France"</span>,
  <span style="color: #c3e88d;">"Germany"</span>,
  <span style="color: #c3e88d;">"Ireland"</span>,
  <span style="color: #c3e88d;">"Italy"</span>,
  <span style="color: #c3e88d;">"Japan"</span>,
  <span style="color: #c3e88d;">"Netherlands"</span>,
  <span style="color: #c3e88d;">"New Zealand"</span>,
  <span style="color: #c3e88d;">"Norway"</span>,
  <span style="color: #c3e88d;">"Portugal"</span>,
  <span style="color: #c3e88d;">"Spain"</span>,
  <span style="color: #c3e88d;">"Sweden"</span>,
  <span style="color: #c3e88d;">"Switzerland"</span>,
  <span style="color: #c3e88d;">"UK"</span>,
  <span style="color: #c3e88d;">"USA"</span> <span style="color: #556369;"># </span><span style="color: #556369;">Ausente no original</span>
<span style="color: #f78c6c;">)</span>


ISOs <span style="color: #f78c6c;">&lt;-</span> data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span>file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/coord_capitais.csv"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>pais <span style="color: #f78c6c;">%in%</span> paises<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>ISO3C<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>ISO <span style="color: #f78c6c;">=</span> ISO3C<span style="color: #f78c6c;">)</span>

df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>ISO <span style="color: #f78c6c;">%in%</span> ISOs$ISO <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">c</span><span style="color: #f78c6c;">())</span>
    
    
</pre>
</div>
</div>
</div>




<div id="outline-container-org3e9f5d7" class="outline-3">
<h3 id="org3e9f5d7">Exportando</h3>
<div class="outline-text-3" id="text-org3e9f5d7">
<div class="org-src-container">
<pre class="src src-R">data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/conflitos_filtrados_n_violentos_continentes.csv"</span><span style="color: #f78c6c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1f3a829" class="outline-2">
<h2 id="org1f3a829">Calculando inverso da distância</h2>
<div class="outline-text-2" id="text-org1f3a829">
<div class="latex" id="org9f284f2">
\begin{equation}
Cold war Event = 1000 \cdot \sum W_{j}\cdot CR_{j}
\end{equation}

</div>

<div class="latex" id="org865643b">
\begin{equation}
W_{j} = dist^{-2}
\end{equation}

</div>

<p>
em que dist é medido em quilometros.
</p>

<div class="org-src-container">
<pre class="src src-R">
data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/conflitos_filtrados_n_violentos_continentes.csv"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">-&gt;</span> df

<span style="color: #82aaff;">inv_dist2</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #89DDFF;">function</span><span style="color: #f78c6c;">(</span>x, pow<span style="color: #f78c6c;">=-</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">){</span>
  x^pow*<span style="color: #f78c6c; font-weight: bold;">10</span>^<span style="color: #f78c6c; font-weight: bold;">3</span>
<span style="color: #f78c6c;">}</span>

df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">across</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">where</span><span style="color: #f78c6c;">(</span>is.numeric<span style="color: #f78c6c;">)</span>, ~<span style="color: #82aaff;">inv_dist2</span><span style="color: #f78c6c;">(</span>.x<span style="color: #f78c6c;">)))</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, file <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"./clean/coldwar_inv2_n_violentos_selecionados.csv"</span><span style="color: #f78c6c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org98d79df" class="outline-2">
<h2 id="org98d79df">Incluindo dados de distribuição</h2>
<div class="outline-text-2" id="text-org98d79df">
</div>
<div id="outline-container-orge92f21a" class="outline-3">
<h3 id="orge92f21a">Script Lorena</h3>
<div class="outline-text-3" id="text-orge92f21a">
<div class="org-src-container">
<pre class="src src-R">one_percent_income <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">read.csv2</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./raw/WID_Data_11042021-185939.csv"</span><span style="color: #f78c6c;">)</span>

<span style="color: #556369;"># </span><span style="color: #556369;">subseting</span>
year <span style="color: #f78c6c;">&lt;-</span> one_percent_income<span style="color: #f78c6c;">[</span>, <span style="color: #f78c6c; font-weight: bold;">1</span>, drop <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">FALSE</span><span style="color: #f78c6c;">]</span>
income <span style="color: #f78c6c;">&lt;-</span> one_percent_income<span style="color: #f78c6c;">[</span>, <span style="color: #f78c6c; font-weight: bold;">2</span>:<span style="color: #f78c6c; font-weight: bold;">19</span><span style="color: #f78c6c;">]</span>

<span style="color: #556369;"># </span><span style="color: #556369;">cleaning data</span>
<span style="color: #556369;"># </span><span style="color: #556369;">gsub() or nchar() as additional options</span>
<span style="color: #82aaff;">colnames</span><span style="color: #f78c6c;">(</span>income<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">substring</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">colnames</span><span style="color: #f78c6c;">(</span>income<span style="color: #f78c6c;">)</span>, <span style="color: #f78c6c; font-weight: bold;">52</span><span style="color: #f78c6c;">)</span>

<span style="color: #556369;"># </span><span style="color: #556369;">transforming in ISO3</span>
<span style="color: #82aaff;">colnames</span><span style="color: #f78c6c;">(</span>income<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">countrycode</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">colnames</span><span style="color: #f78c6c;">(</span>income<span style="color: #f78c6c;">)</span>, origin <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"country.name"</span>, destination <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"iso3c"</span><span style="color: #f78c6c;">)</span>

<span style="color: #556369;"># </span><span style="color: #556369;">joining subsets again</span>
income_concentration <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">cbind</span><span style="color: #f78c6c;">(</span>year, income<span style="color: #f78c6c;">)</span>

<span style="color: #556369;"># </span><span style="color: #556369;">exporting to csv</span>
<span style="color: #82aaff;">write.csv</span><span style="color: #f78c6c;">(</span>income_concentration, <span style="color: #c3e88d;">"./clean/income_concentration.csv"</span><span style="color: #f78c6c;">)</span>
</pre>
</div>
</div>
</div>
