Coordenadas.org
** Renomeando países para ISO

#+begin_src R :tangle ./coordenadas.R

inicio <- "1945"
fim <- "1989"

df <- data.table::fread(
                    './clean/income_concentration.csv',
                    header=TRUE
                    ) %>%
  select(-c(V1)) %>%
  mutate(Year = lubridate::ymd(Year, truncated = 2L)) %>%
  rename(UK = United.Kingdom, `New Zealand` = New.Zealand) %>%
  pivot_longer(!Year, names_to = "pais", values_to = "concentracao") %>%
  mutate(ISO = countrycode::countrycode(pais, origin ='country.name',destination ='iso3c', warn = FALSE)) %>%
  select(-c(pais)) %>%
  pivot_wider(names_from = ISO, values_from = concentracao) %>% # Preenchendo NAs para selecionar os primeiros
  fill(everything(), .direction = "updown") %>% # Transpondo para criar primeiro e último valor
  pivot_longer(-Year) %>%
  pivot_wider(names_from = Year, values_from = value) %>%
  select(name, starts_with(fim), starts_with(inicio)) %>%
  setNames(c("ISO", "Fim", "Inicio")) %>%
  mutate(Diff = (Fim - Inicio)/Inicio)

data.table::fwrite(df, paste0("./clean/diff_concentracao_", fim, "_", inicio, ".csv"))

#+end_src

#+RESULTS:
:results:
:end:



** Unindo com distâncias

#+begin_src R :tangle ./coordenadas.R
data.table::fread(paste0("./clean/diff_concentracao_", fim, "_", inicio, ".csv")) -> concentracao
data.table::fread("./clean/coldwar_inv2_n_violentos_selecionados.csv") -> coldwar

df <- coldwar %>%
  left_join(concentracao)

data.table::fwrite(df, paste0("./clean/coldwar_concentracao_", fim, "_", inicio, ".csv"))
#+end_src

#+RESULTS:
:results:
Joining, by = "ISO"
:end:


* Unindo com dados do artigo de referência


** Dicionário de variáveis

#+NAME: dicionario
|--------------------------------+-----------------------------------+-------------|
| Variavel                       | Descricao                         | Uso         |
|--------------------------------+-----------------------------------+-------------|
| year                           | Year                              | Input       |
| code                           | ISO code                          | Explicativa |
| cold_war_events                | Cold War Events                   | Consulta    |
| pc                             | Communist Party Share of seats    | Explicativa |
| wage_bargaining_centralization | Wage bargaining centralization    | Alternativa |
| decentralized                  | Decentralized Bargain             | Explicativa |
| union                          | Union Density                     | Explicativa |
| Left_Executive                 | Left Executive                    | Alternativa |
| polity2                        | Polity IV index (Polity2 index?)  | Explicativa |
| war_risk                       | War risk                          | Alternativa |
| cultural_distance_cw           | Cultural Distance                 | Alternativa |
| strikes                        | Labor Strikes (?)                 | Alternativa |
| top_1                          | Top 1% of income                  | Consulta    |
| top_5                          | Top 5% of income                  | Resultado   |
| top_10                         | Top 10% of income                 | Resultado   |
| gini                           | Gini                              | Resultado   |
| sstran                         | Social security transfers (% GDP) | Resultado   |
| yr_sch                         | Years of Schooling                | Resultado   |
|--------------------------------+-----------------------------------+-------------|

