Coordenadas.html


<div id="outline-container-orgb4ddb05" class="outline-3">
<h3 id="orgb4ddb05">Renomeando países para ISO</h3>
<div class="outline-text-3" id="text-orgb4ddb05">
<div class="org-src-container">
<pre class="src src-R">
inicio <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c3e88d;">"1945"</span>
fim <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c3e88d;">"1989"</span>

df <span style="color: #f78c6c;">&lt;-</span> data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span>
                    <span style="color: #c3e88d;">'./clean/income_concentration.csv'</span>,
                    header<span style="color: #f78c6c;">=</span><span style="color: #c792ea;">TRUE</span>
                    <span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span><span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span>V1<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>Year <span style="color: #f78c6c;">=</span> lubridate::<span style="color: #82aaff;">ymd</span><span style="color: #f78c6c;">(</span>Year, truncated <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">2L</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>UK <span style="color: #f78c6c;">=</span> United.Kingdom, <span style="color: #EEFFFF; background-color: #1C262B;">`New Zealand`</span> <span style="color: #f78c6c;">=</span> New.Zealand<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">pivot_longer</span><span style="color: #f78c6c;">(</span>!Year, names_to <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"pais"</span>, values_to <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"concentracao"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>ISO <span style="color: #f78c6c;">=</span> countrycode::<span style="color: #82aaff;">countrycode</span><span style="color: #f78c6c;">(</span>pais, origin <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'country.name'</span>,destination <span style="color: #f78c6c;">=</span><span style="color: #c3e88d;">'iso3c'</span>, warn <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">FALSE</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span><span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span>pais<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">pivot_wider</span><span style="color: #f78c6c;">(</span>names_from <span style="color: #f78c6c;">=</span> ISO, values_from <span style="color: #f78c6c;">=</span> concentracao<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #556369;"># </span><span style="color: #556369;">Preenchendo NAs para selecionar os primeiros</span>
  <span style="color: #82aaff;">fill</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">everything</span><span style="color: #f78c6c;">()</span>, .direction <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"updown"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #556369;"># </span><span style="color: #556369;">Transpondo para criar primeiro e &#250;ltimo valor</span>
  <span style="color: #82aaff;">pivot_longer</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span>Year<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">pivot_wider</span><span style="color: #f78c6c;">(</span>names_from <span style="color: #f78c6c;">=</span> Year, values_from <span style="color: #f78c6c;">=</span> value<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>name, <span style="color: #82aaff;">starts_with</span><span style="color: #f78c6c;">(</span>fim<span style="color: #f78c6c;">)</span>, <span style="color: #82aaff;">starts_with</span><span style="color: #f78c6c;">(</span>inicio<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">setNames</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"ISO"</span>, <span style="color: #c3e88d;">"Fim"</span>, <span style="color: #c3e88d;">"Inicio"</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>Diff <span style="color: #f78c6c;">=</span> <span style="color: #f78c6c;">(</span>Fim <span style="color: #f78c6c;">-</span> Inicio<span style="color: #f78c6c;">)</span><span style="color: #f78c6c;">/</span>Inicio<span style="color: #f78c6c;">)</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/diff_concentracao_"</span>, fim, <span style="color: #c3e88d;">"_"</span>, inicio, <span style="color: #c3e88d;">".csv"</span><span style="color: #f78c6c;">))</span>

</pre>
</div>
</div>
</div>



<div id="outline-container-orgb92c672" class="outline-3">
<h3 id="orgb92c672">Unindo com distâncias</h3>
<div class="outline-text-3" id="text-orgb92c672">
<div class="org-src-container">
<pre class="src src-R">data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/diff_concentracao_"</span>, fim, <span style="color: #c3e88d;">"_"</span>, inicio, <span style="color: #c3e88d;">".csv"</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">-&gt;</span> concentracao
data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/coldwar_inv2_n_violentos_selecionados.csv"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">-&gt;</span> coldwar

df <span style="color: #f78c6c;">&lt;-</span> coldwar <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">left_join</span><span style="color: #f78c6c;">(</span>concentracao<span style="color: #f78c6c;">)</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/coldwar_concentracao_"</span>, fim, <span style="color: #c3e88d;">"_"</span>, inicio, <span style="color: #c3e88d;">".csv"</span><span style="color: #f78c6c;">))</span>
</pre>
</div>

<p>
Joining, by = &ldquo;ISO&rdquo;
</p>
</div>
</div>
</div>


<div id="outline-container-org653e40a" class="outline-2">
<h2 id="org653e40a">Unindo com dados do artigo de referência</h2>
<div class="outline-text-2" id="text-org653e40a">
</div>
<div id="outline-container-org1129ae3" class="outline-3">
<h3 id="org1129ae3">Dicionário de variáveis</h3>
<div class="outline-text-3" id="text-org1129ae3">
<table id="org61d6e9e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variavel</th>
<th scope="col" class="org-left">Descricao</th>
<th scope="col" class="org-left">Uso</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">year</td>
<td class="org-left">Year</td>
<td class="org-left">Input</td>
</tr>

<tr>
<td class="org-left">code</td>
<td class="org-left">ISO code</td>
<td class="org-left">Explicativa</td>
</tr>

<tr>
<td class="org-left">cold_war_events</td>
<td class="org-left">Cold War Events</td>
<td class="org-left">Consulta</td>
</tr>

<tr>
<td class="org-left">pc</td>
<td class="org-left">Communist Party Share of seats</td>
<td class="org-left">Explicativa</td>
</tr>

<tr>
<td class="org-left">wage_bargaining_centralization</td>
<td class="org-left">Wage bargaining centralization</td>
<td class="org-left">Alternativa</td>
</tr>

<tr>
<td class="org-left">decentralized</td>
<td class="org-left">Decentralized Bargain</td>
<td class="org-left">Explicativa</td>
</tr>

<tr>
<td class="org-left">union</td>
<td class="org-left">Union Density</td>
<td class="org-left">Explicativa</td>
</tr>

<tr>
<td class="org-left">Left_Executive</td>
<td class="org-left">Left Executive</td>
<td class="org-left">Alternativa</td>
</tr>

<tr>
<td class="org-left">polity2</td>
<td class="org-left">Polity IV index (Polity2 index?)</td>
<td class="org-left">Explicativa</td>
</tr>

<tr>
<td class="org-left">war_risk</td>
<td class="org-left">War risk</td>
<td class="org-left">Alternativa</td>
</tr>

<tr>
<td class="org-left">cultural_distance_cw</td>
<td class="org-left">Cultural Distance</td>
<td class="org-left">Alternativa</td>
</tr>

<tr>
<td class="org-left">strikes</td>
<td class="org-left">Labor Strikes (?)</td>
<td class="org-left">Alternativa</td>
</tr>

<tr>
<td class="org-left">top_1</td>
<td class="org-left">Top 1% of income</td>
<td class="org-left">Consulta</td>
</tr>

<tr>
<td class="org-left">top_5</td>
<td class="org-left">Top 5% of income</td>
<td class="org-left">Resultado</td>
</tr>

<tr>
<td class="org-left">top_10</td>
<td class="org-left">Top 10% of income</td>
<td class="org-left">Resultado</td>
</tr>

<tr>
<td class="org-left">gini</td>
<td class="org-left">Gini</td>
<td class="org-left">Resultado</td>
</tr>

<tr>
<td class="org-left">sstran</td>
<td class="org-left">Social security transfers (% GDP)</td>
<td class="org-left">Resultado</td>
</tr>

<tr>
<td class="org-left">yr_sch</td>
<td class="org-left">Years of Schooling</td>
<td class="org-left">Resultado</td>
</tr>
</tbody>
</table>
</div>
</div>
