Coordenadas.org
** Importando dados

#+begin_src R :var dicionario=dicionario  :tangle ./coordenadas.R
names(dicionario) <- as.matrix(dicionario[1, ])
dicionario <- dicionario[-1, ]
dicionario[] <- lapply(dicionario, function(x) type.convert(as.character(x)))

haven::read_dta('./raw/base_JCP_vR1_dez18.dta') -> df

df %>%
    data.table::fwrite(paste0('./clean/santanna_weller_full.csv'))
    
df <- df %>%
  filter(year >= 1945) %>%
  filter(year <= 1990) %>%
  group_by(code) %>%
  summarise(across(where(is.numeric), ~mean(.x, rm.na = TRUE))) %>%
  ungroup() %>%
  select(all_of(dicionario$Variavel)) %>%
  select(-c(year))

df %>%
    data.table::fwrite(paste0('./clean/santanna_weller_subset_media.csv'))

flags <- dicionario %>% select(Uso) %>% filter(Uso != "Input") %>% unique() %>% pull() %>% as.character()

exporter <- function(df, flag){
  dicionario %>% filter(Uso == flag) %>% select(Variavel) %>% pull() %>% as.character() -> subset
  subset <- append("code", subset)
  
  df %>%
    select(all_of(subset)) %>%
    data.table::fwrite(paste0('./clean/santanna_weller_', flag, '_media.csv'))
}

for(flag in flags){exporter(df = df, flag = flag)}

#+end_src

#+RESULTS:
:results:
:end:



** Unindo as bases

*Importante:* A base de dados de Santanna e Weller que será mesclada é a que esta no arquivo =santanna_weller_Explicativa_medias.csv= em que estão os dados médios.

#+begin_src R

data.table::fread(paste0("./clean/coldwar_concentracao_", fim, "_", inicio, ".csv")) -> df
data.table::fread("./clean/santanna_weller_Explicativa_media.csv") -> santanna_weller
santanna_weller <- santanna_weller %>%
  rename(ISO = code)

df <- df %>%
  left_join(santanna_weller)

data.table::fwrite(df, './clean/coldwar_concentracao_santanna_weller.csv')
    
#+end_src

#+RESULTS:
:results:
Joining, by = "ISO"
:end:


* Calibragem

