Coordenadas.html

<div id="outline-container-org587c7ad" class="outline-3">
<h3 id="org587c7ad">Importando dados</h3>
<div class="outline-text-3" id="text-org587c7ad">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #82aaff;">names</span><span style="color: #f78c6c;">(</span>dicionario<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">as.matrix</span><span style="color: #f78c6c;">(</span>dicionario<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">1</span>, <span style="color: #f78c6c;">])</span>
dicionario <span style="color: #f78c6c;">&lt;-</span> dicionario<span style="color: #f78c6c;">[</span><span style="color: #f78c6c;">-</span><span style="color: #f78c6c; font-weight: bold;">1</span>, <span style="color: #f78c6c;">]</span>
dicionario<span style="color: #f78c6c;">[]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">lapply</span><span style="color: #f78c6c;">(</span>dicionario, <span style="color: #89DDFF;">function</span><span style="color: #f78c6c;">(</span>x<span style="color: #f78c6c;">)</span> <span style="color: #82aaff;">type.convert</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">as.character</span><span style="color: #f78c6c;">(</span>x<span style="color: #f78c6c;">)))</span>

haven::<span style="color: #82aaff;">read_dta</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./raw/base_JCP_vR1_dez18.dta'</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">-&gt;</span> df

df <span style="color: #f78c6c;">%&gt;%</span>
    data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./clean/santanna_weller_full.csv'</span><span style="color: #f78c6c;">))</span>
    
df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>year <span style="color: #f78c6c;">&gt;=</span> <span style="color: #f78c6c; font-weight: bold;">1945</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>year <span style="color: #f78c6c;">&lt;=</span> <span style="color: #f78c6c; font-weight: bold;">1990</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">group_by</span><span style="color: #f78c6c;">(</span>code<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">summarise</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">across</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">where</span><span style="color: #f78c6c;">(</span>is.numeric<span style="color: #f78c6c;">)</span>, ~<span style="color: #82aaff;">mean</span><span style="color: #f78c6c;">(</span>.x, rm.na <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">TRUE</span><span style="color: #f78c6c;">)))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">ungroup</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">all_of</span><span style="color: #f78c6c;">(</span>dicionario$Variavel<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span><span style="color: #82aaff;">c</span><span style="color: #f78c6c;">(</span>year<span style="color: #f78c6c;">))</span>

df <span style="color: #f78c6c;">%&gt;%</span>
    data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./clean/santanna_weller_subset_media.csv'</span><span style="color: #f78c6c;">))</span>

flags <span style="color: #f78c6c;">&lt;-</span> dicionario <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>Uso<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>Uso !<span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"Input"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">unique</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">pull</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.character</span><span style="color: #f78c6c;">()</span>

<span style="color: #82aaff;">exporter</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #89DDFF;">function</span><span style="color: #f78c6c;">(</span>df, flag<span style="color: #f78c6c;">){</span>
  dicionario <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">filter</span><span style="color: #f78c6c;">(</span>Uso <span style="color: #f78c6c;">==</span> flag<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>Variavel<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">pull</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.character</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">-&gt;</span> subset
  subset <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">append</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"code"</span>, subset<span style="color: #f78c6c;">)</span>
  
  df <span style="color: #f78c6c;">%&gt;%</span>
    <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">all_of</span><span style="color: #f78c6c;">(</span>subset<span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
    data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./clean/santanna_weller_'</span>, flag, <span style="color: #c3e88d;">'_media.csv'</span><span style="color: #f78c6c;">))</span>
<span style="color: #f78c6c;">}</span>

<span style="color: #89DDFF;">for</span><span style="color: #f78c6c;">(</span>flag <span style="color: #89DDFF;">in</span> flags<span style="color: #f78c6c;">){</span><span style="color: #82aaff;">exporter</span><span style="color: #f78c6c;">(</span>df <span style="color: #f78c6c;">=</span> df, flag <span style="color: #f78c6c;">=</span> flag<span style="color: #f78c6c;">)}</span>

</pre>
</div>
</div>
</div>



<div id="outline-container-org2f0a94d" class="outline-3">
<h3 id="org2f0a94d">Unindo as bases</h3>
<div class="outline-text-3" id="text-org2f0a94d">
<p>
<b>Importante:</b> A base de dados de Santanna e Weller que será mesclada é a que esta no arquivo <code>santanna_weller_Explicativa_medias.csv</code> em que estão os dados médios.
</p>

<div class="org-src-container">
<pre class="src src-R">
data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/coldwar_concentracao_"</span>, fim, <span style="color: #c3e88d;">"_"</span>, inicio, <span style="color: #c3e88d;">".csv"</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">-&gt;</span> df
data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"./clean/santanna_weller_Explicativa_media.csv"</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">-&gt;</span> santanna_weller
santanna_weller <span style="color: #f78c6c;">&lt;-</span> santanna_weller <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>ISO <span style="color: #f78c6c;">=</span> code<span style="color: #f78c6c;">)</span>

df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">left_join</span><span style="color: #f78c6c;">(</span>santanna_weller<span style="color: #f78c6c;">)</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, <span style="color: #c3e88d;">'./clean/coldwar_concentracao_santanna_weller.csv'</span><span style="color: #f78c6c;">)</span>
    
</pre>
</div>

<p>
Joining, by = &ldquo;ISO&rdquo;
</p>
</div>
</div>
</div>
