Coordenadas.org
** Calibrando conflitos

Os conflitos serão calibrados de acordo com o método indireto.
Para evitar a sensibilidade da amostra, transpõe-se o dataframe.
Desse modo, as âncoras qualitativas serão associadas aos países e não as continentes que os conflitos ocorreram.

#+begin_src R

data.table::fread('./clean/coldwar_concentracao_santanna_weller.csv') %>% as.data.frame() -> df

tmp <- df %>%
  select(
    ISO,
    Violentos_Europa, NaoViolentos_Europa,
    Violentos_Asia, NaoViolentos_Asia,
    Violentos_Africa, NaoViolentos_Africa,
    Violentos_Americas, NaoViolentos_Americas,
    Violentos, NaoViolentos
  ) %>%
  rename_with(.cols = -ISO, .fn = ~ paste0(.x, "_cal")) %>%
   pivot_longer(-ISO) %>%
   pivot_wider(names_from=ISO, values_from=value)

for(country in names(tmp)[-1]){
  new_name <- paste0(country, "_cal")
  x <- tmp[country] %>% as.vector() %>% t()
  # Find quantiles
  quant <- quantile(x, probs = seq(0, 1, 0.2))

  # Theoretical calibration
  x_cal <- NA
  x_cal[x <= quant[1]] <- 0
  x_cal[x > quant[1] & x <= quant[2]] <- .2
  x_cal[x > quant[2] & x <= quant[3]] <- .4
  x_cal[x > quant[3] & x <= quant[4]] <- .6
  x_cal[x > quant[4] & x <= quant[5]] <- .8
  x_cal[x > quant[5]] <- 1

  tmp[country] <- indirectCalibration(x %>% as.vector(), x_cal, binom = TRUE)
}

tmp <- tmp %>%
  ## select(name, ends_with("_cal")) %>%
  rename(Conflito = name) %>%
  pivot_longer(-Conflito) %>%
  pivot_wider(names_from=Conflito, values_from=value) %>%
  rename(ISO = name)

df <- df %>%
  left_join(tmp)

data.table::fwrite(df, './clean/full_distancias_calibradas.csv')
#+end_src

#+RESULTS:
:results:
:end:

