Coordenadas.html


<div id="outline-container-org54068cb" class="outline-2">
<h2 id="org54068cb">Calibragem</h2>
<div class="outline-text-2" id="text-org54068cb">
</div>
<div id="outline-container-org7407cb7" class="outline-3">
<h3 id="org7407cb7">Calibrando conflitos</h3>
<div class="outline-text-3" id="text-org7407cb7">
<p>
Os conflitos serão calibrados de acordo com o método indireto.
Para evitar a sensibilidade da amostra, transpõe-se o dataframe.
Desse modo, as âncoras qualitativas serão associadas aos países e não as continentes que os conflitos ocorreram.
</p>

<div class="org-src-container">
<pre class="src src-R">
data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./clean/coldwar_concentracao_santanna_weller.csv'</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.data.frame</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">-&gt;</span> df

tmp <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>
    ISO,
    Violentos_Europa, NaoViolentos_Europa,
    Violentos_Asia, NaoViolentos_Asia,
    Violentos_Africa, NaoViolentos_Africa,
    Violentos_Americas, NaoViolentos_Americas,
    Violentos, NaoViolentos
  <span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename_with</span><span style="color: #f78c6c;">(</span>.cols <span style="color: #f78c6c;">=</span> <span style="color: #f78c6c;">-</span>ISO, .fn <span style="color: #f78c6c;">=</span> ~ <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span>.x, <span style="color: #c3e88d;">"_cal"</span><span style="color: #f78c6c;">))</span> <span style="color: #f78c6c;">%&gt;%</span>
   <span style="color: #82aaff;">pivot_longer</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span>ISO<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
   <span style="color: #82aaff;">pivot_wider</span><span style="color: #f78c6c;">(</span>names_from<span style="color: #f78c6c;">=</span>ISO, values_from<span style="color: #f78c6c;">=</span>value<span style="color: #f78c6c;">)</span>

<span style="color: #89DDFF;">for</span><span style="color: #f78c6c;">(</span>country <span style="color: #89DDFF;">in</span> <span style="color: #82aaff;">names</span><span style="color: #f78c6c;">(</span>tmp<span style="color: #f78c6c;">)[</span><span style="color: #f78c6c;">-</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]){</span>
  new_name <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span>country, <span style="color: #c3e88d;">"_cal"</span><span style="color: #f78c6c;">)</span>
  x <span style="color: #f78c6c;">&lt;-</span> tmp<span style="color: #f78c6c;">[</span>country<span style="color: #f78c6c;">]</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.vector</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">t</span><span style="color: #f78c6c;">()</span>
  <span style="color: #556369;"># </span><span style="color: #556369;">Find quantiles</span>
  quant <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">quantile</span><span style="color: #f78c6c;">(</span>x, probs <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">seq</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c; font-weight: bold;">0</span>, <span style="color: #f78c6c; font-weight: bold;">1</span>, <span style="color: #f78c6c; font-weight: bold;">0.2</span><span style="color: #f78c6c;">))</span>

  <span style="color: #556369;"># </span><span style="color: #556369;">Theoretical calibration</span>
  x_cal <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">NA</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #f78c6c; font-weight: bold;">0</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">2</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.2</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">2</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">3</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.4</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">3</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">4</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.6</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">4</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">5</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.8</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">5</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #f78c6c; font-weight: bold;">1</span>

  tmp<span style="color: #f78c6c;">[</span>country<span style="color: #f78c6c;">]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">indirectCalibration</span><span style="color: #f78c6c;">(</span>x <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.vector</span><span style="color: #f78c6c;">()</span>, x_cal, binom <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">TRUE</span><span style="color: #f78c6c;">)</span>
<span style="color: #f78c6c;">}</span>

tmp <span style="color: #f78c6c;">&lt;-</span> tmp <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #556369;">## </span><span style="color: #556369;">select(name, ends_with("_cal")) %&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>Conflito <span style="color: #f78c6c;">=</span> name<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">pivot_longer</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c;">-</span>Conflito<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">pivot_wider</span><span style="color: #f78c6c;">(</span>names_from<span style="color: #f78c6c;">=</span>Conflito, values_from<span style="color: #f78c6c;">=</span>value<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename</span><span style="color: #f78c6c;">(</span>ISO <span style="color: #f78c6c;">=</span> name<span style="color: #f78c6c;">)</span>

df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">left_join</span><span style="color: #f78c6c;">(</span>tmp<span style="color: #f78c6c;">)</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, <span style="color: #c3e88d;">'./clean/full_distancias_calibradas.csv'</span><span style="color: #f78c6c;">)</span>
</pre>
</div>
</div>
</div>
