Coordenadas.org
** Calibrando outras variáveis

Tal como para os conflitos, será utilizado o método indireto.
Diferentemente dos conflitos, o cálculo será feito entre países.

#+begin_src R
data.table::fread('./clean/full_distancias_calibradas.csv') -> df

tmp <- df %>%
  select(
    ISO,
    ## Diff,
    pc,
    decentralized
  ) %>%
  as.data.frame()

for(variable in names(tmp)[-1]){
  x <- tmp[variable] %>% as.vector() %>% t()
  # Find quantiles
  quant <- quantile(x, probs = seq(0, 1, 0.2))

  # Theoretical calibration
  x_cal <- NA
  x_cal[x <= quant[1]] <- 0
  x_cal[x > quant[1] & x <= quant[2]] <- .2
  x_cal[x > quant[2] & x <= quant[3]] <- .4
  x_cal[x > quant[3] & x <= quant[4]] <- .6
  x_cal[x > quant[4] & x <= quant[5]] <- .8
  x_cal[x > quant[5]] <- 1

  tmp[variable] <- indirectCalibration(x %>% as.vector(), x_cal, binom = TRUE)
}

tmp <- tmp %>%
  rename_with(.cols = -ISO, .fn = ~ paste0(.x, "_cal"))

diff_cal <- calibrate(
  x = df$Diff %>% as.vector(),
  thresholds = "e=-0.6, c=-0.00001, i=0.6"
)

df <- df %>%
  mutate(Diff_cal = diff_cal) %>%
  left_join(tmp)

data.table::fwrite(df, './clean/raw_calibrados.csv')
data.table::fwrite(
              df %>% select(ISO,  ends_with("_cal")),
              './clean/calibrados.csv')
#+end_src

#+RESULTS:
:results:
Joining, by = "ISO"
:end:


* Tabela verdade e minimização

** Maior concentração (1989 - 1945 > 0)

