Coordenadas.html

<div id="outline-container-orgf581f47" class="outline-3">
<h3 id="orgf581f47">Calibrando outras variáveis</h3>
<div class="outline-text-3" id="text-orgf581f47">
<p>
Tal como para os conflitos, será utilizado o método indireto.
Diferentemente dos conflitos, o cálculo será feito entre países.
</p>

<div class="org-src-container">
<pre class="src src-R">data.table::<span style="color: #82aaff;">fread</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">'./clean/full_distancias_calibradas.csv'</span><span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">-&gt;</span> df

tmp <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>
    ISO,
    <span style="color: #556369;">## </span><span style="color: #556369;">Diff,</span>
    pc,
    decentralized
  <span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">as.data.frame</span><span style="color: #f78c6c;">()</span>

<span style="color: #89DDFF;">for</span><span style="color: #f78c6c;">(</span>variable <span style="color: #89DDFF;">in</span> <span style="color: #82aaff;">names</span><span style="color: #f78c6c;">(</span>tmp<span style="color: #f78c6c;">)[</span><span style="color: #f78c6c;">-</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]){</span>
  x <span style="color: #f78c6c;">&lt;-</span> tmp<span style="color: #f78c6c;">[</span>variable<span style="color: #f78c6c;">]</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.vector</span><span style="color: #f78c6c;">()</span> <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">t</span><span style="color: #f78c6c;">()</span>
  <span style="color: #556369;"># </span><span style="color: #556369;">Find quantiles</span>
  quant <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">quantile</span><span style="color: #f78c6c;">(</span>x, probs <span style="color: #f78c6c;">=</span> <span style="color: #82aaff;">seq</span><span style="color: #f78c6c;">(</span><span style="color: #f78c6c; font-weight: bold;">0</span>, <span style="color: #f78c6c; font-weight: bold;">1</span>, <span style="color: #f78c6c; font-weight: bold;">0.2</span><span style="color: #f78c6c;">))</span>

  <span style="color: #556369;"># </span><span style="color: #556369;">Theoretical calibration</span>
  x_cal <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">NA</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #f78c6c; font-weight: bold;">0</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">1</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">2</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.2</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">2</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">3</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.4</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">3</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">4</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.6</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">4</span><span style="color: #f78c6c;">]</span> &amp; x <span style="color: #f78c6c;">&lt;=</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">5</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #c792ea;">.8</span>
  x_cal<span style="color: #f78c6c;">[</span>x <span style="color: #f78c6c;">&gt;</span> quant<span style="color: #f78c6c;">[</span><span style="color: #f78c6c; font-weight: bold;">5</span><span style="color: #f78c6c;">]]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #f78c6c; font-weight: bold;">1</span>

  tmp<span style="color: #f78c6c;">[</span>variable<span style="color: #f78c6c;">]</span> <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">indirectCalibration</span><span style="color: #f78c6c;">(</span>x <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.vector</span><span style="color: #f78c6c;">()</span>, x_cal, binom <span style="color: #f78c6c;">=</span> <span style="color: #c792ea;">TRUE</span><span style="color: #f78c6c;">)</span>
<span style="color: #f78c6c;">}</span>

tmp <span style="color: #f78c6c;">&lt;-</span> tmp <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">rename_with</span><span style="color: #f78c6c;">(</span>.cols <span style="color: #f78c6c;">=</span> <span style="color: #f78c6c;">-</span>ISO, .fn <span style="color: #f78c6c;">=</span> ~ <span style="color: #82aaff;">paste0</span><span style="color: #f78c6c;">(</span>.x, <span style="color: #c3e88d;">"_cal"</span><span style="color: #f78c6c;">))</span>

diff_cal <span style="color: #f78c6c;">&lt;-</span> <span style="color: #82aaff;">calibrate</span><span style="color: #f78c6c;">(</span>
  x <span style="color: #f78c6c;">=</span> df$Diff <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">as.vector</span><span style="color: #f78c6c;">()</span>,
  thresholds <span style="color: #f78c6c;">=</span> <span style="color: #c3e88d;">"e=-0.6, c=-0.00001, i=0.6"</span>
<span style="color: #f78c6c;">)</span>

df <span style="color: #f78c6c;">&lt;-</span> df <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">mutate</span><span style="color: #f78c6c;">(</span>Diff_cal <span style="color: #f78c6c;">=</span> diff_cal<span style="color: #f78c6c;">)</span> <span style="color: #f78c6c;">%&gt;%</span>
  <span style="color: #82aaff;">left_join</span><span style="color: #f78c6c;">(</span>tmp<span style="color: #f78c6c;">)</span>

data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>df, <span style="color: #c3e88d;">'./clean/raw_calibrados.csv'</span><span style="color: #f78c6c;">)</span>
data.table::<span style="color: #82aaff;">fwrite</span><span style="color: #f78c6c;">(</span>
              df <span style="color: #f78c6c;">%&gt;%</span> <span style="color: #82aaff;">select</span><span style="color: #f78c6c;">(</span>ISO,  <span style="color: #82aaff;">ends_with</span><span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"_cal"</span><span style="color: #f78c6c;">))</span>,
              <span style="color: #c3e88d;">'./clean/calibrados.csv'</span><span style="color: #f78c6c;">)</span>
</pre>
</div>

<p>
Joining, by = &ldquo;ISO&rdquo;
</p>
</div>
</div>
</div>


<div id="outline-container-org22cecd5" class="outline-2">
<h2 id="org22cecd5">Tabela verdade e minimização</h2>
<div class="outline-text-2" id="text-org22cecd5">
</div>
<div id="outline-container-orga49d8b5" class="outline-3">
<h3 id="orga49d8b5">Maior concentração (1989 - 1945 &gt; 0)</h3>
<div class="outline-text-3" id="text-orga49d8b5">
</div>
