Coordenadas.org
*** Tabela verdade

#+begin_src R :results output html table
df <- data.table::fread('./clean/calibrados.csv') %>% as.data.frame()

df <- df %>%
  set_names(
    ~ str_to_upper(.) %>%
                  str_replace_all("_CAL", "") %>%
                  str_replace_all("VIOLENTOS", "V") %>%
                  str_replace_all("AFRICA", "AFR") %>%
                  str_replace_all("AMERICAS", "AME") %>%
                  str_replace_all("EUROPA", "EUR") %>%
                  str_replace_all("NAO", "N")
  ) %>%
  rename(DEC = DECENTRALIZED)

conds <- df %>%  select(-c(DIFF, V, NV, ISO)) %>%
  select(-c(starts_with("N"))) %>%
  names() %>%
  as.vector()

TT <- truthTable(
  data = df,
  outcome = "~DIFF",
  conditions = conds,
  complete = TRUE,
  show.cases = TRUE,
  incl.cut = 0.8,
  sort.by = "out, incl"
)

stargazerTT(TT, show.cases = TRUE, type = "html")
#+end_src

#+RESULTS:
#+begin_export html

<table style="text-align:center"><tr><td colspan="12" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left"></td><td>V_EUR</td><td>V_ASIA</td><td>V_AFR</td><td>V_AME</td><td>PC</td><td>DEC</td><td>OUT</td><td>n</td><td>incl</td><td>PRI</td><td>cases</td></tr>
<tr><td colspan="12" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left">21</td><td>0</td><td>1</td><td>0</td><td>1</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0.971</td><td>0.953</td><td>15</td></tr>
<tr><td style="text-align:left">41</td><td>1</td><td>0</td><td>1</td><td>0</td><td>0</td><td>0</td><td>1</td><td>4</td><td>0.890</td><td>0.794</td><td>3,6,7,14</td></tr>
<tr><td style="text-align:left">44</td><td>1</td><td>0</td><td>1</td><td>0</td><td>1</td><td>1</td><td>1</td><td>1</td><td>0.851</td><td>0.201</td><td>8</td></tr>
<tr><td style="text-align:left">43</td><td>1</td><td>0</td><td>1</td><td>0</td><td>1</td><td>0</td><td>1</td><td>5</td><td>0.834</td><td>0.701</td><td>5,11,13,16,17</td></tr>
<tr><td style="text-align:left">18</td><td>0</td><td>1</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1</td><td>0.813</td><td>0.724</td><td>1</td></tr>
<tr><td style="text-align:left">46</td><td>1</td><td>0</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0</td><td>2</td><td>0.701</td><td>0.256</td><td>2,18</td></tr>
<tr><td style="text-align:left">42</td><td>1</td><td>0</td><td>1</td><td>0</td><td>0</td><td>1</td><td>0</td><td>3</td><td>0.669</td><td>0.447</td><td>4,9,10</td></tr>
<tr><td style="text-align:left">52</td><td>1</td><td>1</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0.355</td><td>0</td><td>12</td></tr>
<tr><td style="text-align:left">1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">2</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">3</td><td>0</td><td>0</td><td>0</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">4</td><td>0</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">5</td><td>0</td><td>0</td><td>0</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">6</td><td>0</td><td>0</td><td>0</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">7</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">8</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">9</td><td>0</td><td>0</td><td>1</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">10</td><td>0</td><td>0</td><td>1</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">11</td><td>0</td><td>0</td><td>1</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">12</td><td>0</td><td>0</td><td>1</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">13</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">14</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">15</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">16</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">17</td><td>0</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">19</td><td>0</td><td>1</td><td>0</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">20</td><td>0</td><td>1</td><td>0</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">22</td><td>0</td><td>1</td><td>0</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">23</td><td>0</td><td>1</td><td>0</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">24</td><td>0</td><td>1</td><td>0</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">25</td><td>0</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">26</td><td>0</td><td>1</td><td>1</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">27</td><td>0</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">28</td><td>0</td><td>1</td><td>1</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">29</td><td>0</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">30</td><td>0</td><td>1</td><td>1</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">31</td><td>0</td><td>1</td><td>1</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">32</td><td>0</td><td>1</td><td>1</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">33</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">34</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">35</td><td>1</td><td>0</td><td>0</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">36</td><td>1</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">37</td><td>1</td><td>0</td><td>0</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">38</td><td>1</td><td>0</td><td>0</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">39</td><td>1</td><td>0</td><td>0</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">40</td><td>1</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">45</td><td>1</td><td>0</td><td>1</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">47</td><td>1</td><td>0</td><td>1</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">48</td><td>1</td><td>0</td><td>1</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">49</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">50</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">51</td><td>1</td><td>1</td><td>0</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">53</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">54</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">55</td><td>1</td><td>1</td><td>0</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">56</td><td>1</td><td>1</td><td>0</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">57</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">58</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">59</td><td>1</td><td>1</td><td>1</td><td>0</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">60</td><td>1</td><td>1</td><td>1</td><td>0</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">61</td><td>1</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">62</td><td>1</td><td>1</td><td>1</td><td>1</td><td>0</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">63</td><td>1</td><td>1</td><td>1</td><td>1</td><td>1</td><td>0</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td style="text-align:left">64</td><td>1</td><td>1</td><td>1</td><td>1</td><td>1</td><td>1</td><td>?</td><td>0</td><td></td><td></td><td></td></tr>
<tr><td colspan="12" style="border-bottom: 1px solid black"></td></tr></table>
#+end_export

*** Solução conservadora

#+begin_src R :results output html table
MIN <- minimize(TT)

stargazerSol(MIN, type = "html", outcome = "~DIFF", show.cases = TRUE)
#+end_src

#+RESULTS:
#+begin_export html

<table style="text-align:center"><tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left"></td><td>inclS</td><td>PRI</td><td>covS</td><td>covU</td><td>cases</td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left">V_EUR* ~ V_ASIA* V_AFR* ~ V_AME* PC</td><td>0.820</td><td>0.674</td><td>0.353</td><td>0.017</td><td>5,11,13,16,17; 8</td></tr>
<tr><td style="text-align:left">V_EUR* ~ V_ASIA* V_AFR* ~ V_AME* ~ DEC</td><td>0.850</td><td>0.748</td><td>0.551</td><td>0.215</td><td>3,6,7,14; 5,11,13,16,17</td></tr>
<tr><td style="text-align:left">~ V_EUR* V_ASIA* ~ V_AFR* ~ V_AME* ~ PC* DEC</td><td>0.813</td><td>0.724</td><td>0.058</td><td>0.019</td><td>1</td></tr>
<tr><td style="text-align:left">~ V_EUR* V_ASIA* ~ V_AFR* V_AME* ~ PC* ~ DEC</td><td>0.971</td><td>0.953</td><td>0.114</td><td>0.068</td><td>15</td></tr>
<tr><td style="text-align:left">Solution</td><td>0.847</td><td>0.752</td><td>0.693</td><td></td><td></td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr></table>
#+end_export

*** Solução parsimoniosa

#+begin_src R :results output html table
MIN <- minimize(TT, include = "?")

stargazerSol(MIN, type = "html", outcome = "~DIFF", show.cases = TRUE)
#+end_src

#+RESULTS:
#+begin_export html

<table style="text-align:center"><tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left"></td><td>inclS</td><td>PRI</td><td>covS</td><td>covU</td><td>cases</td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr><tr><td style="text-align:left">~ V_EUR</td><td>0.846</td><td>0.742</td><td>0.198</td><td>0</td><td>1; 15</td></tr>
<tr><td style="text-align:left">~ DEC</td><td>0.731</td><td>0.631</td><td>0.805</td><td>0.158</td><td>15; 3,6,7,14; 5,11,13,16,17</td></tr>
<tr><td style="text-align:left">~ V_ASIA* PC</td><td>0.807</td><td>0.647</td><td>0.365</td><td>0</td><td>5,11,13,16,17; 8</td></tr>
<tr><td style="text-align:left">Solution</td><td>0.702</td><td>0.586</td><td>0.939</td><td></td><td></td></tr>
<tr><td colspan="6" style="border-bottom: 1px solid black"></td></tr></table>
#+end_export

* TODOs


